[Killed] BlockStatement
cloud_talks/sentinel/src/mutant-detector-service.js:6:32
 const HUMAN_MAX_BRAIN_ACTIVITY = 10000.0
 const INVALID_PERSON = 'Invalid person value';
 
-function evaluateList(persons) {
-    const result = [];
-    for (person of persons) {
-        result.push(evaluatePerson(person));
-    }
-    return result;
-}
+function evaluateList(persons) {}
 
 function evaluatePerson(person) {

[Killed] BlockStatement
cloud_talks/sentinel/src/mutant-detector-service.js:8:29
 
 function evaluateList(persons) {
     const result = [];
-    for (person of persons) {
-        result.push(evaluatePerson(person));
-    }
+    for (person of persons) {}
     return result;
 }

[Killed] BlockStatement
cloud_talks/sentinel/src/mutant-detector-service.js:14:33
     return result;
 }
 
-function evaluatePerson(person) {
-    if (!_.has(person, 'name') || !_.has(person, 'brain_activity')) {
-        throw INVALID_PERSON;
-    }
-
-    return {
-        name: person['name'],
-        diagnostic: isHuman(person['brain_activity']) ? 'human' : 'mutant'
-    };
-}
+function evaluatePerson(person) {}
 
 function isHuman(brainActivity) {

[Killed] BooleanLiteral
cloud_talks/sentinel/src/mutant-detector-service.js:15:35
 }
 
 function evaluatePerson(person) {
-    if (!_.has(person, 'name') || !_.has(person, 'brain_activity')) {
+    if (!_.has(person, 'name') || _.has(person, 'brain_activity')) {
         throw INVALID_PERSON;
     }

[Killed] ConditionalExpression
cloud_talks/sentinel/src/mutant-detector-service.js:15:9
 }
 
 function evaluatePerson(person) {
-    if (!_.has(person, 'name') || !_.has(person, 'brain_activity')) {
+    if (false) {
         throw INVALID_PERSON;
     }

[Survived] BlockStatement
cloud_talks/sentinel/src/mutant-detector-service.js:25:33
     };
 }
 
-function isHuman(brainActivity) {
-    return brainActivity <= HUMAN_MAX_BRAIN_ACTIVITY;
-}
+function isHuman(brainActivity) {}
 
 module.exports = {

[Survived] EqualityOperator
cloud_talks/sentinel/src/mutant-detector-service.js:26:12
 }
 
 function isHuman(brainActivity) {
-    return brainActivity <= HUMAN_MAX_BRAIN_ACTIVITY;
+    return brainActivity < HUMAN_MAX_BRAIN_ACTIVITY;
 }
 

[Survived] ConditionalExpression
cloud_talks/sentinel/src/mutant-detector-service.js:26:12
 }
 
 function isHuman(brainActivity) {
-    return brainActivity <= HUMAN_MAX_BRAIN_ACTIVITY;
+    return true;
 }
 
